mysensors/ArduinoHwAVR/boards.txt
menu.cpu=Processor
menu.LTO=Compiler LTO

######################################
## Sensebender Micro

MysensorsMicro.name=Sensebender Micro

MysensorsMicro.upload.tool=arduino:avrdude
MysensorsMicro.upload.protocol=arduino
MysensorsMicro.upload.maximum_size=30720
MysensorsMicro.upload.maximum_data_size=2048
MysensorsMicro.upload.speed=57600

MysensorsMicro.bootloader.tool=arduino:avrdude
MysensorsMicro.bootloader.unlock_bits=0x3F
MysensorsMicro.bootloader.lock_bits=0x0F
MysensorsMicro.bootloader.low_fuses=0xE2
MysensorsMicro.bootloader.high_fuses=0xD2
MysensorsMicro.bootloader.extended_fuses=0x06
MysensorsMicro.bootloader.file=DualOptiboot/optiboot_atmega328_pro_8MHz.hex

MysensorsMicro.build.board=AVR_MICRO8
MysensorsMicro.build.core=arduino:arduino
MysensorsMicro.build.variant=micro
MysensorsMicro.build.mcu=atmega328p
#MysensorsMicro.build.f_cpu=8000000L

MysensorsMicro.menu.cpu.8Mhz=Atmega328 8Mhz
MysensorsMicro.menu.cpu.8Mhz.build.f_cpu=8000000L 

MysensorsMicro.menu.cpu.1Mhz=Atmega328 1Mhz
MysensorsMicro.menu.cpu.1Mhz.build.f_cpu=1000000L

# Compiler link time optimization
MysensorsMicro.menu.LTO.Os=Disabled (default)
MysensorsMicro.menu.LTO.Os.compiler.c.extra_flags=
MysensorsMicro.menu.LTO.Os.compiler.c.elf.extra_flags=
MysensorsMicro.menu.LTO.Os.compiler.cpp.extra_flags=
MysensorsMicro.menu.LTO.Os.ltoarcmd=avr-ar

MysensorsMicro.menu.LTO.Os_flto=Enabled
MysensorsMicro.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
MysensorsMicro.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
MysensorsMicro.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
MysensorsMicro.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar
